def XOR_cipher():
   char_code = {"0":0, "1":1, "2":2, "3":3, "4":4,
                "5":5, "6":6, "7":7, "8":8, "9":9,

                "q":10, "w":11, "e":12, "r":13, "t":14,
                "y":15, "u":16, "i":17, "o":18, "p":19,
                "a":20, "s":21, "d":22, "f":23, "g":24,
                "h":25, "j":26, "k":27, "l":28, "z":29,
                "x":30, "c":31, "v":32, "b":33, "n":34,
                "m":35,

                "ё":36, "й":37, "ц":38, "у":39, "к":40,
                "е":41, "н":42, "г":43, "ш":44, "щ":45,
                "з":46, "х":47, "ъ":48, "ф":49, "ы":50,
                "в":51, "а":52, "п":53, "р":54, "о":55,
                "л":56, "д":57, "ж":58, "э":59, "я":60,
                "ч":61, "с":62, "м":63, "и":64, "т":65,
                "ь":66, "б":67, "ю":68,

                "!":69, "@":70, "#":71, "$":72, "%":73,
                "^":74, "&":75, "*":76, "(":77, ")":78,
                "-":79, "=":80, "_":81, "+":82, "{":83,
                "}":84, "[":85, "]":86, "\\":87, "|":88,
                ";":89, ":":90, "'":91, '"':92, "<":93,
                ">":94, ",":95, ".":96, "?":97, "/":98,
                "№":99, " ":100,

                "α":101, "β":102, "γ":103, "δ":104, "ε":105,
                "ζ":106, "η":107, "θ":108, "ι":109, "κ":110,
                "λ":111, "μ":112, "ν":113, "ξ":114, "ο":115,
                "π":116, "ρ":117, "σ":118, "τ":119, "υ":120,
                "φ":121, "χ":122, "ψ":123, "ω":124, "Ω":125,
                "£":126, "¥":127
               }

   processed_data = ""
   processed_key = []
   i = 0
   data = input("Введите строку для кодирования: ")
   key = input("Введите ключ шифрования: ")

   for char in key.lower():
      if char in char_code:
         processed_key.append(char_code[char])
      else:
       return print("Ошибка в ключе")

   for char in data.lower():
      if char in char_code:
         for item, value in char_code.items():
            if value == (processed_key[i] ^ char_code[char]):
               processed_data += item
      else:
       return print("Ошибка в data")
      if i+1 == len(key):
         i = 0
      else:
         i+=1

   return print(processed_data)

XOR_cipher()
XOR_cipher()
